{
  "This site is intended for people who are learning to communicate with API": "هذا الموقع مخصص للأشخاص الذين يتعلمون التواصل مع API",
  "Home": "الرئيسية",
  "Documentations": "دليل الربط",
  "Test online": "تجربة",
  "Free API": "مجاني API",
  "About Us": "معلومات عنا ",
  "This site was built by one of Flexcourses students and it is an API using the beautiful Larvel framework and the frontend are designed using the beautiful also Vue js in order to provide assistance to people who learn to communicate with the API.": "تم إنشاء هذا الموقع بواسطة أحد طلاب Flexcourses وهو عبارة عن واجهة برمجة تطبيقات تستخدم إطار عمل Larvel الجميل وتم تصميم الواجهة الأمامية باستخدام Vue js الجميلة أيضًا من أجل تقديم المساعدة للأشخاص الذين يتعلمون التواصل مع API.",
  "Services": "الخدمات ",
  "This site provides a set of services to communicate with the API, which are as follows:": "يوفر هذا الموقع مجموعة من الخدمات للتواصل مع API وهي كالتالي:",
  "User registration": "تسجيل مستخدم",
  "You will learn here how to register a new user in the database and try all the services on this site after registration": "سوف تتعلم هنا كيفية تسجيل مستخدم جديد في قاعدة البيانات وتجربة جميع الخدمات على هذا الموقع بعد التسجيل",
  "User login": "دخول المستخدم",
  "how to user log in as well as edit he profile and add a personal photo": "كيفية تسجيل دخول المستخدم وكذلك تحرير الملف الشخصي وإضافة صورة شخصية",
  "Show photos": "عرض الصور",
  "Post photos": "نشر الصور",
  "how to upload and save images to a database and how to delete them": "كيفية تحميل وحفظ الصور في قاعدة بيانات وكيفية حذفها",
  "how to fetch all the photos posted by all users on the site": "كيفية جلب جميع الصور المنشورة من قبل جميع المستخدمين على الموقع",
  "API contact guide": "دليل الإتصال بـ API",
  "NOTE: You can communicate from this API without the need to register on the site, and this service is free and there is no obligation to pay a fee to use it.": "ملاحظة: يمكنك التواصل من خلال واجهة برمجة التطبيقات هذه دون الحاجة للتسجيل في الموقع ، وهذه الخدمة مجانية ولا يوجد أي التزام بدفع رسوم مقابل استخدامها.",
  "The following operations can be performed:": "يمكن إجراء العمليات التالية:",
  "Add a personal photo and information for you as a user": "أضف صورة ومعلومات شخصية لك كمستخدم",
  "Posting a picture with its title and information about it": "نشر صورة بعنوانها ومعلومات عنها",
  "show all the photos that have been uploaded by users": "عرض جميع الصور التي تم تحميلها من قبل المستخدمين",
  "View your posted photos": "عرض الصور الخاصة بك المنشورة",
  "Delete your posted photos": "حذف الصور المنشورة الخاصة بك"
}